pet_wellness_app1/app/controllers/pets_controller.rb

  def index
    pets = Pet.all
---
SELECT "pets".* FROM "pets"

  def create
    pet = Pet.create(pet_params)
---
INSERT INTO "pets" ("name", "dob", "breed", "medical", "digestion", "appointment", "diary", "misc", "user_id", "created_at", "updated_at", "sex") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

    def update
        pet = Pet.find(params[:id])
        pet.update(pet_params)
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "pets" SET "sex" = $1, "updated_at" = $2 WHERE "pets"."id" = $3  [["sex", "Male"], ["updated_at", "2020-09-09 18:44:09.832206"], ["id", 3]]

    def destroy
        pet = Pet.find(params[:id])
        if pet.destroy
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 2]]